/* BizSimAI - Japanese Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "ログイン";
"common.logout" = "ログアウト";
"common.save" = "保存";
"common.cancel" = "キャンセル";
"common.error" = "エラー";
"common.loading" = "読み込み中...";
"common.success" = "成功";
"common.retry" = "再試行";
"common.submit" = "送信";
"common.back" = "戻る";
"common.done" = "完了";
"common.delete" = "削除";
"common.edit" = "編集";
"common.close" = "閉じる";

/* Authentication */
"auth.professor_login" = "教授ログイン";
"auth.student_access" = "学生アクセス";
"auth.username" = "ユーザー名";
"auth.password" = "パスワード";
"auth.student_id" = "学生ID";
"auth.full_name" = "氏名";
"auth.team_name" = "チーム名";
"auth.register" = "登録して参加";
"auth.sign_in_apple" = "Appleでサインイン";
"auth.sign_in_google" = "Googleでサインイン";
"auth.session_expired" = "セッションが期限切れです。再度ログインしてください。";

/* Session */
"session.create" = "セッションを作成";
"session.join" = "セッションに参加";
"session.code" = "セッションコード";
"session.round" = "ラウンド %d / %d";
"session.status_waiting" = "プレイヤー待ち";
"session.status_active" = "進行中";
"session.status_completed" = "完了";
"session.end" = "セッションを終了";
"session.delete" = "セッションを削除";

/* Decisions */
"decision.submit" = "意思決定を送信";
"decision.submitted" = "意思決定が送信されました";
"decision.over_budget" = "予算超過";
"decision.invalid" = "無効な意思決定";

/* Results */
"results.leaderboard" = "リーダーボード";
"results.profit" = "利益";
"results.revenue" = "収益";
"results.market_share" = "市場シェア";
"results.stock_price" = "株価";
"results.cumulative" = "累計";

/* Sync */
"sync.online" = "オンライン";
"sync.offline" = "オフライン";
"sync.syncing" = "同期中...";
"sync.error" = "同期に失敗しました";
"sync.saved_locally" = "ローカルに保存しました";

/* Professor */
"prof.dashboard" = "ダッシュボード";
"prof.sessions" = "セッション";
"prof.analytics" = "分析";
"prof.announcements" = "お知らせ";
"prof.grade_mapping" = "成績マッピング";

/* Student */
"student.team_dashboard" = "チームダッシュボード";
"student.ai_coach" = "AIコーチ";
"student.performance" = "パフォーマンス";

/* Navigation */
"nav.home" = "ホーム";
"nav.settings" = "設定";
"nav.profile" = "プロフィール";
"nav.help" = "ヘルプ";

/* Errors */
"error.network" = "ネットワークエラー。接続を確認してください。";
"error.server" = "サーバーエラー。後でもう一度お試しください。";
"error.unauthorized" = "認証されていません。再度ログインしてください。";
"error.not_found" = "リソースが見つかりません。";
